tiborsimon/embedded-tdd-headers/pic/8bit/pic18f14k22_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F14K22_H_
#define _PIC18F14K22_H_

#define SRCON0                        0
#define SRPR                          1
#define SRPS                          2
#define SRNQEN                        3
#define SRQEN                         4
#define SRCLK0                        5
#define SRCLK                         6
#define SRCLK1                        7
#define SRCLK2                        8
#define SRLEN                         9
#define SRCON1                        10
#define SRRC1E                        11
#define SRRC2E                        12
#define SRRCKE                        13
#define SRRPE                         14
#define SRSC1E                        15
#define SRSC2E                        16
#define SRSCKE                        17
#define SRSPE                         18
#define CM2CON0                       19
#define C2CH0                         20
#define C2CH                          21
#define C2CH1                         22
#define C2R                           23
#define C2SP                          24
#define C2POL                         25
#define C2OE                          26
#define C2OUT                         27
#define C2ON                          28
#define CM2CON1                       29
#define C2SYNC                        30
#define C1SYNC                        31
#define C2HYS                         32
#define C1HYS                         33
#define C2RSEL                        34
#define C1RSEL                        35
#define MC2OUT                        36
#define MC1OUT                        37
#define CM1CON0                       38
#define C1CH                          39
#define C1CH0                         40
#define C1CH1                         41
#define C1R                           42
#define C1SP                          43
#define C1POL                         44
#define C1OE                          45
#define C1OUT                         46
#define C1ON                          47
#define SSPMSK                        48
#define MSK0                          49
#define MSK                           50
#define MSK1                          51
#define MSK2                          52
#define MSK3                          53
#define MSK4                          54
#define MSK5                          55
#define MSK6                          56
#define MSK7                          57
#define SLRCON                        58
#define SLRA                          59
#define SLRB                          60
#define SLRC                          61
#define WPUA0                         62
#define WPUA                          63
#define WPUA1                         64
#define WPUA2                         65
#define WPUA3                         66
#define WPUA4                         67
#define WPUA5                         68
#define WPUB                          69
#define WPUB4                         70
#define WPUB5                         71
#define WPUB6                         72
#define WPUB7                         73
#define IOCA0                         74
#define IOCA                          75
#define IOCA1                         76
#define IOCA2                         77
#define IOCA3                         78
#define IOCA4                         79
#define IOCA5                         80
#define IOCB                          81
#define IOCB4                         82
#define IOCB5                         83
#define IOCB6                         84
#define IOCB7                         85
#define ANSEL                         86
#define ANSEL0                        87
#define ANS0                          88
#define ANS1                          89
#define ANSEL1                        90
#define ANSEL2                        91
#define ANS2                          92
#define ANSEL3                        93
#define ANS3                          94
#define ANSEL4                        95
#define ANS4                          96
#define ANSEL5                        97
#define ANS5                          98
#define ANSEL6                        99
#define ANS6                          100
#define ANSEL7                        101
#define ANS7                          102
#define ANS8                          103
#define ANSEL8                        104
#define ANSELH                        105
#define ANS9                          106
#define ANSEL9                        107
#define ANSEL10                       108
#define ANS10                         109
#define ANS11                         110
#define ANSEL11                       111
#define PORTA                         112
#define ULPWUIN                       113
#define C1INP                         114
#define AN0                           115
#define PGD                           116
#define PORTA_RA0                     117
#define CVREF                         118
#define INT0                          119
#define VREFM                         120
#define AN1                           121
#define PGC                           122
#define PORTA_RA1                     123
#define INT1                          124
#define VREFP                         125
#define C12IN0M                       126
#define PORTA_RA2                     127
#define AN2                           128
#define T0CKI                         129
#define INT2                          130
#define SRQ                           131
#define RA3                           132
#define VPP                           133
#define NOT_MCLR                      134
#define MCLR                          135
#define nMCLR                         136
#define CLKOUT                        137
#define AN3                           138
#define PORTA_RA4                     139
#define OSC2                          140
#define CLKIN                         141
#define PORTA_RA5                     142
#define T13CKI                        143
#define OSC1                          144
#define LVDIN                         145
#define PORTB                         146
#define SDA                           147
#define AN10                          148
#define SDI                           149
#define PORTB_RB4                     150
#define RX                            151
#define PORTB_RB5                     152
#define AN11                          153
#define DT                            154
#define SCL                           155
#define SCK                           156
#define PORTB_RB6                     157
#define CK                            158
#define PORTB_RB7                     159
#define TX                            160
#define PORTC                         161
#define PORTC_RC0                     162
#define C12INP                        163
#define AN4                           164
#define C2INP                         165
#define AN5                           166
#define CCP2                          167
#define C12IN1M                       168
#define PA2                           169
#define PORTC_RC1                     170
#define PA1                           171
#define AN6                           172
#define P1D                           173
#define C12IN2M                       174
#define PORTC_RC2                     175
#define AN7                           176
#define PGM                           177
#define C12IN3M                       178
#define P1C                           179
#define PORTC_RC3                     180
#define C12OUT                        181
#define P1B                           182
#define SRNQ                          183
#define PORTC_RC4                     184
#define CCP1                          185
#define P1A                           186
#define PORTC_RC5                     187
#define AN8                           188
#define nSS                           189
#define NOT_SS                        190
#define SS                            191
#define PORTC_RC6                     192
#define AN9                           193
#define SDO                           194
#define PORTC_RC7                     195
#define LATA                          196
#define LATA0                         197
#define LA0                           198
#define LATA1                         199
#define LA1                           200
#define LATA2                         201
#define LA2                           202
#define LATA4                         203
#define LA4                           204
#define LATA5                         205
#define LA5                           206
#define LATB                          207
#define LB4                           208
#define LATB4                         209
#define LB5                           210
#define LATB5                         211
#define LB6                           212
#define LATB6                         213
#define LB7                           214
#define LATB7                         215
#define LATC                          216
#define LATC0                         217
#define LC0                           218
#define LATC1                         219
#define LC1                           220
#define LATC2                         221
#define LC2                           222
#define LATC3                         223
#define LC3                           224
#define LATC4                         225
#define LC4                           226
#define LATC5                         227
#define LC5                           228
#define LATC6                         229
#define LC6                           230
#define LATC7                         231
#define LC7                           232
#define TRISA                         233
#define TRISA_RA0                     234
#define TRISA0                        235
#define TRISA_RA1                     236
#define TRISA1                        237
#define TRISA2                        238
#define TRISA_RA2                     239
#define TRISA_RA4                     240
#define TRISA4                        241
#define TRISA_RA5                     242
#define TRISA5                        243
#define TRISB                         244
#define TRISB4                        245
#define TRISB_RB4                     246
#define TRISB5                        247
#define TRISB_RB5                     248
#define TRISB6                        249
#define TRISB_RB6                     250
#define TRISB7                        251
#define TRISB_RB7                     252
#define TRISC                         253
#define TRISC0                        254
#define TRISC_RC0                     255
#define TRISC1                        256
#define TRISC_RC1                     257
#define TRISC2                        258
#define TRISC_RC2                     259
#define TRISC3                        260
#define TRISC_RC3                     261
#define TRISC4                        262
#define TRISC_RC4                     263
#define TRISC5                        264
#define TRISC_RC5                     265
#define TRISC6                        266
#define TRISC_RC6                     267
#define TRISC7                        268
#define TRISC_RC7                     269
#define OSCTUNE                       270
#define TUN0                          271
#define TUN                           272
#define TUN1                          273
#define TUN2                          274
#define TUN3                          275
#define TUN4                          276
#define TUN5                          277
#define PLLEN                         278
#define INTSRC                        279
#define PIE1                          280
#define TMR1IE                        281
#define TMR2IE                        282
#define CCP1IE                        283
#define SSPIE                         284
#define TXIE                          285
#define TX1IE                         286
#define RCIE                          287
#define RC1IE                         288
#define ADIE                          289
#define PIR1                          290
#define TMR1IF                        291
#define TMR2IF                        292
#define CCP1IF                        293
#define SSPIF                         294
#define TXIF                          295
#define TX1IF                         296
#define RCIF                          297
#define RC1IF                         298
#define ADIF                          299
#define IPR1                          300
#define TMR1IP                        301
#define TMR2IP                        302
#define CCP1IP                        303
#define SSPIP                         304
#define TX1IP                         305
#define TXIP                          306
#define RC1IP                         307
#define RCIP                          308
#define ADIP                          309
#define PIE2                          310
#define TMR3IE                        311
#define BCLIE                         312
#define EEIE                          313
#define C2IE                          314
#define C1IE                          315
#define CMIE                          316
#define OSCFIE                        317
#define PIR2                          318
#define TMR3IF                        319
#define BCLIF                         320
#define EEIF                          321
#define C2IF                          322
#define C1IF                          323
#define CMIF                          324
#define OSCFIF                        325
#define IPR2                          326
#define TMR3IP                        327
#define BCLIP                         328
#define EEIP                          329
#define C2IP                          330
#define C1IP                          331
#define CMIP                          332
#define OSCFIP                        333
#define EECON1                        334
#define RD                            335
#define WR                            336
#define WREN                          337
#define WRERR                         338
#define FREE                          339
#define CFGS                          340
#define EEFS                          341
#define EEPGD                         342
#define EEADR                         343
#define EEADR0                        344
#define EEADR1                        345
#define EEADR2                        346
#define EEADR3                        347
#define EEADR4                        348
#define EEADR5                        349
#define EEADR6                        350
#define EEADR7                        351
#define RCSTA                         352
#define RCD8                          353
#define RX9D                          354
#define OERR                          355
#define FERR                          356
#define ADDEN                         357
#define ADEN                          358
#define CREN                          359
#define SRENA                         360
#define SREN                          361
#define RC9                           362
#define RC8_9                         363
#define RX9                           364
#define SPEN                          365
#define TXSTA                         366
#define TXD8                          367
#define TX9D1                         368
#define TX9D                          369
#define TRMT                          370
#define TRMT1                         371
#define BRGH1                         372
#define BRGH                          373
#define SENDB1                        374
#define SENDB                         375
#define SYNC                          376
#define SYNC1                         377
#define TXEN1                         378
#define TXEN                          379
#define TX91                          380
#define TX8_9                         381
#define TX9                           382
#define CSRC1                         383
#define CSRC                          384
#define T3CON                         385
#define TMR3ON                        386
#define TMR3CS                        387
#define nT3SYNC                       388
#define NOT_T3SYNC                    389
#define T3SYNC                        390
#define SOSCEN3                       391
#define T3CCP1                        392
#define T3CKPS                        393
#define T3CKPS0                       394
#define T3CKPS1                       395
#define T3CON_RD16                    396
#define T3RD16                        397
#define RD163                         398
#define ECCP1AS                       399
#define PSSBD                         400
#define PSSBD0                        401
#define PSSBD1                        402
#define PSSAC                         403
#define PSSAC0                        404
#define PSSAC1                        405
#define ECCPAS0                       406
#define ECCPAS                        407
#define ECCPAS1                       408
#define ECCPAS2                       409
#define ECCPASE                       410
#define PWM1CON                       411
#define PDC0                          412
#define PDC                           413
#define PDC1                          414
#define PDC2                          415
#define PDC3                          416
#define PDC4                          417
#define PDC5                          418
#define PDC6                          419
#define PRSEN                         420
#define BAUDCON                       421
#define ABDEN                         422
#define W4E                           423
#define WUE                           424
#define BRG16                         425
#define SCKP                          426
#define CKTXP                         427
#define RXCKP                         428
#define DTRXP                         429
#define RCIDL                         430
#define ABDOVF                        431
#define PSTRCON                       432
#define STRA                          433
#define STRB                          434
#define STRC                          435
#define STRD                          436
#define STRSYNC                       437
#define VREFCON0                      438
#define FVR1S0                        439
#define FVR1S1                        440
#define FVR1ST                        441
#define FVR1EN                        442
#define VREFCON1                      443
#define D1NSS0                        444
#define D1NSS                         445
#define D1PSS                         446
#define D1PSS0                        447
#define D1PSS1                        448
#define DAC1OE                        449
#define D1LPS                         450
#define D1EN                          451
#define VREFCON2                      452
#define DAC1R                         453
#define DAC1R0                        454
#define DAC1R1                        455
#define DAC1R2                        456
#define DAC1R3                        457
#define DAC1R4                        458
#define CCP1CON                       459
#define CCP1M0                        460
#define CCP1M                         461
#define CCP1M1                        462
#define CCP1M2                        463
#define CCP1M3                        464
#define DC1B                          465
#define DC1B0                         466
#define DC1B1                         467
#define P1M                           468
#define P1M0                          469
#define P1M1                          470
#define ADCON2                        471
#define ADCS0                         472
#define ADCS                          473
#define ADCS1                         474
#define ADCS2                         475
#define ACQT0                         476
#define ACQT                          477
#define ACQT1                         478
#define ACQT2                         479
#define ADFM                          480
#define ADCON1                        481
#define NVCFG                         482
#define NVCFG0                        483
#define NVCFG1                        484
#define PVCFG                         485
#define PVCFG0                        486
#define CHSN3                         487
#define PVCFG1                        488
#define ADCON0                        489
#define ADON                          490
#define nDONE                         491
#define GO_nDONE                      492
#define NOT_DONE                      493
#define GODONE                        494
#define GO_DONE                       495
#define DONE                          496
#define GO_NOT_DONE                   497
#define GO                            498
#define CHS0                          499
#define CHS                           500
#define CHS1                          501
#define CHS2                          502
#define CHS3                          503
#define SSPCON2                       504
#define SEN                           505
#define RSEN                          506
#define PEN                           507
#define RCEN                          508
#define ACKEN                         509
#define ACKDT                         510
#define ACKSTAT                       511
#define GCEN                          512
#define SSPCON1                       513
#define SSPM0                         514
#define SSPM                          515
#define SSPM1                         516
#define SSPM2                         517
#define SSPM3                         518
#define CKP                           519
#define SSPEN                         520
#define SSPOV                         521
