tiborsimon/embedded-tdd-headers/pic/8bit/pic18f14k22_tdd.h
#define WCOL                          522
#define SSPSTAT                       523
#define BF                            524
#define UA                            525
#define R_NOT_W                       526
#define NOT_W                         527
#define nW                            528
#define RW                            529
#define nWRITE                        530
#define R                             531
#define W                             532
#define NOT_WRITE                     533
#define R_nW                          534
#define R_W                           535
#define START                         536
#define S                             537
#define STOP                          538
#define P                             539
#define A                             540
#define NOT_A                         541
#define nA                            542
#define D_A                           543
#define D_nA                          544
#define D                             545
#define DA                            546
#define D_NOT_A                       547
#define NOT_ADDRESS                   548
#define nADDRESS                      549
#define CKE                           550
#define SMP                           551
#define T2CON                         552
#define T2CKPS0                       553
#define T2CKPS                        554
#define T2CKPS1                       555
#define TMR2ON                        556
#define T2OUTPS0                      557
#define T2OUTPS                       558
#define T2OUTPS1                      559
#define T2OUTPS2                      560
#define T2OUTPS3                      561
#define PR2                           562
#define WM0                           563
#define WM1                           564
#define WAIT0                         565
#define WAIT1                         566
#define EBDIS                         567
#define T1CON                         568
#define TMR1ON                        569
#define TMR1CS                        570
#define NOT_T1SYNC                    571
#define T1SYNC                        572
#define nT1SYNC                       573
#define T1OSCEN                       574
#define SOSCEN                        575
#define T1CKPS0                       576
#define T1CKPS                        577
#define T1CKPS1                       578
#define T1RUN                         579
#define T1CON_RD16                    580
#define T1RD16                        581
#define RCON                          582
#define BOR                           583
#define NOT_BOR                       584
#define nBOR                          585
#define POR                           586
#define nPOR                          587
#define NOT_POR                       588
#define PD                            589
#define nPD                           590
#define NOT_PD                        591
#define NOT_TO                        592
#define nTO                           593
#define TO                            594
#define nRI                           595
#define NOT_RI                        596
#define RI                            597
#define SBOREN                        598
#define IPEN                          599
#define WDTCON                        600
#define SWDTE                         601
#define SWDTEN                        602
#define OSCCON2                       603
#define LFIOFS                        604
#define HFIOFL                        605
#define PRI_SD                        606
#define OSCCON                        607
#define SCS0                          608
#define SCS                           609
#define SCS1                          610
#define FLTS                          611
#define HFIOFS                        612
#define OSTS                          613
#define IRCF                          614
#define IRCF0                         615
#define IRCF1                         616
#define IRCF2                         617
#define IDLEN                         618
#define T0CON                         619
#define T0PS                          620
#define T0PS0                         621
#define T0PS1                         622
#define T0PS2                         623
#define PSA                           624
#define T0SE                          625
#define T0CS                          626
#define T08BIT                        627
#define TMR0ON                        628
#define STATUS                        629
#define C                             630
#define CARRY                         631
#define DC                            632
#define ZERO                          633
#define Z                             634
#define OV                            635
#define OVERFLOW                      636
#define N                             637
#define NEGATIVE                      638
#define INTCON3                       639
#define INT1IF                        640
#define INT1F                         641
#define INT2IF                        642
#define INT2F                         643
#define INT1E                         644
#define INT1IE                        645
#define INT2IE                        646
#define INT2E                         647
#define INT1P                         648
#define INT1IP                        649
#define INT2IP                        650
#define INT2P                         651
#define INTCON2                       652
#define RABIP                         653
#define RBIP                          654
#define TMR0IP                        655
#define INTEDG2                       656
#define INTEDG1                       657
#define INTEDG0                       658
#define nRABPU                        659
#define NOT_RABPU                     660
#define NOT_RBPU                      661
#define nRBPU                         662
#define RABPU                         663
#define INTCON                        664
#define RABIF                         665
#define RBIF                          666
#define INT0F                         667
#define INT0IF                        668
#define T0IF                          669
#define TMR0IF                        670
#define RABIE                         671
#define RBIE                          672
#define INT0E                         673
#define INT0IE                        674
#define T0IE                          675
#define TMR0IE                        676
#define PEIE                          677
#define PEIE_GIEL                     678
#define PIE                           679
#define GIEL                          680
#define GIE_GIEH                      681
#define GIE                           682
#define GIEH                          683
#define SP0                           684
#define STKPTR                        685
#define SP1                           686
#define SP2                           687
#define SP3                           688
#define SP4                           689
#define STKUNF                        690
#define STKOVF                        691
#define STKFUL                        692

#endif // _PIC18F14K22_H_
